import React from 'react';
import './home-page.css';
import { ToolItem } from '../../components/tool-item';

const TOOLS = [
    {
        image: '/tool-covers/denzel.jpg',
        title: 'Электрический рубанок DENZEL EP-82 27801',
        features: ['Мощность: 720 Вт', 'Ширина обработки: 82мм', 'Вес нетто:  3,1 кг'],
        price: 4960,
        video: 'https://www.youtube.com//embed/5rNXtVpfAQE',
        id: 1,
        description: "Электрический рубанок DENZEL EP-82 720 Вт, 82мм 27801 используется для обработки деревянных поверхностей. Оснащен выключателем с защитой от случайного пуска.Предусмотрена функция выброса стружки, которая защищает канал от засорения  и позволяет работать долгое время без его очистки.",
    },
    {
        image: '/tool-covers/denzel_ag230.jpg',
        title: 'Угловая шлифовальная машина DENZEL AG230-2400 26915d',
        features: ['Мощность: 2400 Вт', 'Диаметр диска: 230мм', 'Число оборотов: 6000 об/мин', 'Вес нетто: 4,93 кг'],
        video: 'https://www.youtube.com//embed/dVLl2CRQFyI',
        price: 7339,
        id: 2,
        description: 'Угловая шлифовальная машина DENZEL AG230-2400 26915 применяется для шлифования, зачистки поверхностей и резки деталей из различных материалов. Для самостоятельного обслуживания  предусмотрен быстрый доступ к щеточному узлу. Блокировка шпинделя.  Диск заменяется быстро и просто без проворачивания рабочей части болгарки.'
    },
    {
        image: '/tool-covers/bosch-gof130.jpg',
        title: 'Фрезер Bosch GOF 130 06016B7000',
        features: ['Мощность: 1300 Вт', 'Рабочий ход фрезы: 55мм', 'Вес нетто: 3,5 кг'],
        video: 'https://www.youtube.com//embed/2LKqBXhxYRo',
        price: 13479,
        id: 3,
        description: 'Фрезер Bosch GOF 130 06016B7000 используется для фрезерования в древесине, пластмассе и легких строительных материалах. При наличии соответствующей фрезы и выборе низкого числа оборотов возможна обработка цветных металлов. Модель работает с цанговыми патронами диаметром 6 и 8 мм.'
    },
    {
        image: '/tool-covers/denzel_gld460.jpg',
        title: 'Бензиновая газонокосилка Denzel GLD-460SP 58803',
        features: ['Мощность: 4,5 л.с.', 'Ширина скашивания: 46 см', 'Вес нетто: 32,6 кг'],
        video: 'https://www.youtube.com//embed/1PSfHx5wsAM',
        price: 23061,
        id: 4,
        description: 'Бензиновая газонокосилка Denzel GLD-460SP 58803 предназначена для скашивания травы на приусадебном участке. Оснащена мощным и экономичным двигателем Denzel, который создает высокую частоту вращения режущего инструмента. Выполняет боковой выброс, мульчирование, сбор травы с контейнер.'
    },
    {
        image: '/tool-covers/Bosch_GBH220.jpg',
        title: 'Перфоратор Bosch GBH 220 06112A6020',
        video: 'https://www.youtube.com//embed/sBNMHmgCj2E',
        features: ['Мощность: 1300 Вт', 'Сила удара: 2 Дж', 'Вес нетто: 2,3 кг'],
        price: 9969,
        id: 5,
        description: 'Перфоратор Bosch GBH 220 06112A6020 пригодится для сверления отверстий в мягких материалах, а также перфорации в бетоне и кирпиче. Функционирует в трех режимах: безударное сверление, ударное сверление, долбление. Патрон sds-plus обеспечивает быструю смену оснастки'
    },
    {
        image: '/tool-covers/DENZEL_ID750.jpg',
        title: 'Ударная дрель DENZEL ID-750 26307',
        features: ['Мощность: 750 Вт', 'Число скоростей: 1', 'Вес нетто: 3,5 кг'],
        video: 'https://www.youtube.com//embed/z5fx67KCe_A',
        price: 2959,
        id: 6,
        description: 'Ударная дрель DENZEL ID-750 26307 универсальна в эксплуатации. Предназначена для сверления в древесине, металле, кирпичной кладке и легком бетоне. Регулировка скорости в зависимости от особенностей материала. '
    },
]

export const HomePage = () => {
    return (
        <div className="home-page">
            {TOOLS.map(tool => <ToolItem tool={tool} key={tool.id}/>)}
        </div>
    );
}